<template>
  <div class="about">
    <el-container>
  <el-header><NavBar></NavBar></el-header>
</el-container>

<b-container>
  <div style="margin-top: 100px" id="classroom">
    <b-card no-body>
      <b-tabs pills card vertical>
        <b-tab v-for="item in classrooms" v-bind:key="item" v-bind:title="item.name"><b-card-text>
          <template>
            <div style="margin-top: 100px">
              <b-table
                :sticky-header="stickyHeader"
                :no-border-collapse="noCollapse"
                responsive
                :fields="fields"
                v-bind:items="item.schedule"
              
              >
                <!-- We are using utility class `text-nowrap` to help illustrate horizontal scrolling -->
                <template v-slot:head(id)="scope">
                  <div class="text-nowrap">时间段</div>
                </template>
                <template v-slot:head()="scope">
                  <div class="text-nowrap">
                    {{ scope.label }}
                  </div>
                </template>
              </b-table>
            </div>
          </template>
          
        </b-card-text></b-tab>
      </b-tabs>
    </b-card>
  </div>
</b-container>
  </div>
</template>
<script>
// import side from "@/components/fram/sidefram.vue"
// import card from "@/components/card/Card.vue"
import NavBar from "@/components/NavBar.vue"

export default {
  name: 'classroom',
  components: {
       NavBar,
      
  },
  data() {
    return {
      classrooms:[
        {
          name:3201,
          schedule:[
          { 时间段:'上午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'下午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'晚上',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
        ]
        },
        {
          name:3202,
          schedule:[
          { 时间段:'上午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'下午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'晚上',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
        ]
        },
        {
          name:3203,
          schedule:[
          { 时间段:'上午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'下午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'晚上',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
        ]
        }, 
        {
          name:3204,
          schedule:[
          { 时间段:'上午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'下午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'晚上',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
        ]
        },   
        {
          name:3205,
          schedule:[
          { 时间段:'上午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'下午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'晚上',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
        ]
        },   
        {
          name:3206,
          schedule:[
          { 时间段:'上午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'下午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'晚上',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
        ]
        },        
        {
          name:3301,
          schedule:[
          { 时间段:'上午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'下午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'晚上',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
        ]
        },
        {
          name:3302,
          schedule:[
          { 时间段:'上午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'下午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'晚上',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
        ]
        },
        {
          name:3303,
          schedule:[
          { 时间段:'上午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'下午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'晚上',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
        ]
        }, 
        {
          name:3304,
          schedule:[
          { 时间段:'上午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'下午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'晚上',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
        ]
        },   
        {
          name:3305,
          schedule:[
          { 时间段:'上午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'下午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'晚上',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
        ]
        },   
        {
          name:3306,
          schedule:[
          { 时间段:'上午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'下午',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
          { 时间段:'晚上',星期一: '离散数学', 星期二: '已预约', 星期三: '空闲',星期四:'空闲',星期五:'空闲',星期六:'空闲',星期日:'空闲' },
        ]
        },          

        
        ],
      stickyHeader: true,
      noCollapse: false,
      fields: [
        { key: '时间段', stickyColumn: true, isRowHeader: true, variant: 'primary' },
        '星期一',
        '星期二',
        '星期三',
        '星期四',
        '星期五',
        '星期六',
        '星期日',
      ],

    }
  }
}
</script>


<style>
  .el-header, .el-footer {
    background-color:#545c64;
    color: #333;
    text-align: center;
    line-height: 60px;
  }
  
  .el-aside {
    background-color: #545c64;
    color: #333;
    text-align: center;
    line-height: 200px;
  }
  
  .el-main {
    background-color: #E9EEF3;
    color: #333;
    text-align: center;
    line-height: 160px;
  }
  
  body > .el-container {
    margin-bottom: 40px;
  }
  
  .el-container:nth-child(5) .el-aside,
  .el-container:nth-child(6) .el-aside {
    line-height: 260px;
  }
  
  .el-container:nth-child(7) .el-aside {
    line-height: 320px;
  }
</style>